# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [4]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
# your code here
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [6]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
# your code here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 300.0+ bytes

In [8]:
"""
your comments here
"""

#we have 3 columns, City and State are both object types, and Temperature is a float.

'\nyour comments here\n'

#### Select the rows where state is New York.

In [9]:
# your code here
new_york_temp = temp[temp['State'] == 'New York']
new_york_temp

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [10]:
# your code here
new_york_temp['Temperature'].mean()

#The mean/average is 10.7

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [11]:
# your code here
high_temp = temp[temp['Temperature'] > 15]
high_temp

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [12]:
# your code here
high_temp[['City', 'Temperature']]

       City  Temperature
0       NYC    19.444444
3  Hartford    17.222222
5    Treton    22.222222
6    Newark    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [13]:
# your code here
temp_in_range = high_temp[high_temp['Temperature'] < 20]
temp_in_range

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [59]:
temp_grouped = temp.groupby('State')['Temperature'].agg(['mean', 'std'])
pd.DataFrame(temp_grouped)

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [23]:
# your code here
employees = pd.read_csv("Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [24]:
# your code here
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 636.0+ bytes

In [25]:
"""
your comments here
"""
# We have 5 object datatypes and 2 integers. Years in the company and Salary are integers. The Name, Department,
# Education, Gender and Title are objects.

'\nyour comments here\n'

#### What's the average salary in this company?

In [26]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [27]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [28]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [34]:
# your code here
low_salary = employees[employees['Salary'] == 30]
low_salary

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [35]:
# your code here
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [44]:
# your code here
pd.DataFrame(employees['Salary'][employees['Name'] == 'David'])

   Salary
2      30

#### Print all the rows where job title is associate.

In [48]:
# your code here
associates = employees[employees['Title'] == 'associate']
associates

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [45]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [46]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [50]:
# your code here
associates[associates['Salary'] > 55]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [52]:
# your code here
average_salaries = employees.groupby('Years')['Salary'].mean()
pd.DataFrame(average_salaries)

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [53]:
# your code here
average_title_salaries = employees.groupby('Title')['Salary'].mean()
pd.DataFrame(average_title_salaries)

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [66]:
# your code here
employees['Salary'].describe()

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [61]:
# your code here
average_gender_salary = employees.groupby('Gender')['Salary'].mean()
pd.DataFrame(average_gender_salary)

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [69]:
# your code here
employees.groupby('Department').describe()

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [70]:
# your code here
salary_difference = lambda x: x.max() - x.min()
department_salary_diff = employees.groupby('Department')['Salary'].agg(salary_difference)
department_salary_diff

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [71]:
# your code here
orders = pd.read_csv("orders.csv")

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [75]:
# your code here
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [76]:
orders.tail()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [77]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [80]:
orders_summary = orders.drop(['Unnamed: 0', 'InvoiceNo', 'CustomerID'], axis=1).describe()
orders_summary

,year,month,day,hour,Quantity,UnitPrice,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,22.394749
std,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,309.055588
min,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,0.000000
25%,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,4.680000
50%,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,11.800000
75%,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,19.800000
max,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,168469.600000

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here